#+TITLE: Haskell Programming from First Principles Chapter 9 notes/answers
#+NAME: David Ressman
#+EMAIL: davidr@ressman.org
#+LANGUAGE: en
#+STARTUP: indent
#+OPTIONS: num:nil toc:1
#+PROPERTY: header-args:haskell :cache yes :results verbatim :exports both
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />

**** a

#+BEGIN_SRC haskell
map (^2) [1..10]
#+END_SRC

#+RESULTS[85aa06917ddf9d8090f6b1cb5547bbd37093888c]:
: [1,4,9,16,25,36,49,64,81,100]


**** b

#+BEGIN_SRC haskell
map minimum [[1..10], [10..20], [20..30]]
#+END_SRC

#+RESULTS[d5efd2c2622979f6e7b00700761d6368a612e627]:
: [1,10,20]

**** c

#+BEGIN_SRC haskell
map sum [[1..5], [1..5], [1..5]]
#+END_SRC

#+RESULTS[5212c673827215dd207e76a7d3806b241befc3ff]:
: [15,15,15]

*** 6

#+BEGIN_SRC haskell :tangle 9.9-map-implemented-with-bool.hs
  -- the bool funciton lives in Data.Bool
  import Data.Bool

  map (\x -> bool x (-x) (x == 3)) [1..10]
#+END_SRC

#+RESULTS[355cc6e0a84154ddcb40314afca366b28f5e2f9c]:
: Prelude Data.Bool> Prelude Data.Bool> [1,2,-3,4,5,6,7,8,9,10]

* 9.10 Filtering lists of values

note filter's definition:

#+BEGIN_SRC haskell
filter :: (a -> Bool) -> [a] -> [a]
filter _ [] = []
filter pred (x:xs)
  | pred x = x : filter pred xs
  | otherwise = filter pred xs
#+END_SRC

#+BEGIN_SRC haskell
filter (== 'a') "abracadabra"
#+END_SRC

#+RESULTS[3dc24df321eef540f644525f2140a4c3076e96f7]:
: aaaaa

#+BEGIN_SRC haskell
filter (\x -> (rem x 2) == 0) [1..20]
#+END_SRC

#+RESULTS[b2c99441965c4ae73baea9e170aeda2b717c67fc]:
: [2,4,6,8,10,12,14,16,18,20]

/note/: I wonder why they use ~rem x 2 == 0~ so consistently in this book as opposed to ~mod x 2 == 0~
which I feel like is more common. Is rem more efficient? That seems unlikely.

*** 1

give all multiples of 3 out of a list from 1 to 30:

#+BEGIN_SRC haskell
filter (\x -> (mod x 3) == 0) [1..30]
#+END_SRC

#+RESULTS[cfa4b7099b80ee43f9def7b35a636cf8200fa17b]:
: [3,6,9,12,15,18,21,24,27,30]

*** 2

how many multiples of three are there in (1) above? answer using (.)

#+BEGIN_SRC haskell
length . filter (\x -> (mod x 3) == 0) $ [1..30]
#+END_SRC

#+RESULTS[13869d29ec10e09b124f3b2930575bd082a6df2b]:
: 10

*** 3

remove all articles from sentences

#+BEGIN_SRC haskell
-- start with a list of articles we can check words against
let articles = ["the", "a", "an"]

filter (\x -> not (elem x articles)) $ words "the brown dog was a goof"
#+END_SRC

#+RESULTS[443bfbe90f1da8eb24b2b234887ef81d6fc45af0]:
: ["brown","dog","was","goof"]

* 9.11 Zipping lists

Note: zip always ends with the exhaustion of the shorter list

~zip :: [a] -> [b] -> [(a, b)]~

~zipWith :: (a -> b -> c) -> [a] -> [b] -> [c]~

zipWith examples:

#+BEGIN_SRC haskell
zipWith (+) [1, 2, 3] [10, 11, 12]
#+END_SRC

#+RESULTS[8aca4ee3a6a5ce1c8c782762820afa8d697b9c35]:
: [11,13,15]

#+BEGIN_SRC haskell
zipWith (==) ['a'..'f'] ['a'..'z']
#+END_SRC

#+RESULTS[a0452b3c7827afa0a3e342f5f442394ae6624691]:
: [True,True,True,True,True,True]

*** 1

#+BEGIN_SRC haskell
import Data.Char
:t isUpper
#+END_SRC

#+RESULTS[725d00c83ac149d082c9e9e90f7eeec48626a9cd]:
: isUpper :: Char -> Bool

#+BEGIN_SRC haskell
import Data.Char
:t toUpper
#+END_SRC

#+RESULTS[efa34236e854eabf9fe155f60ec91b328f4422f4]:
: toUpper :: Char -> Char

*** 3

#+BEGIN_SRC haskell
import Data.Char

capString :: String -> String
capString (x:xs) = toUpper x : xs

capString "julie"
#+END_SRC

#+RESULTS[f3aeaf3ec8c87458ba4082d76705762b79cd4c66]:
: Prelude Data.Char> "Julie"

*** 4

make a recursive case of (3) above to change all letters to caps

#+BEGIN_SRC haskell
  import Data.Char

  capAllString :: String -> String
  capAllString []     = []
  capAllString (x:xs) = toUpper x : capAllString xs

  capAllString "woot"
#+END_SRC

#+RESULTS[ead3229e241791794d9318cd7d172e6bb9f73627]:
: Prelude Data.Char> "WOOT"

*** 5

#+BEGIN_SRC haskell
:t head
#+END_SRC

#+RESULTS[11b13bce0bbdd8198549473af1d75ca2462d2e74]:
: head :: [a] -> a

Simple function:

#+BEGIN_SRC haskell
import Data.Char

capHead :: String -> Char
capHead s = toUpper (head s)

capHead "julie"
#+END_SRC

#+RESULTS[f822c319f3f09032b7415aaacf205d7adaf30699]:
: Prelude Data.Char> 'J'

*** 6

With function composition:

#+BEGIN_SRC haskell
import Data.Char

capHead :: String -> Char
capHead s = toUpper . head $ s

capHead "julie"
#+END_SRC

#+RESULTS[d1e16dd094c8b2456c7df68cb9785309452f03d4]:
: Prelude Data.Char> 'J'

As pointfree:

#+BEGIN_SRC haskell
import Data.Char

capHead = toUpper . head

capHead "julie"
#+END_SRC

#+RESULTS[51c3f022b6f2eb038819dc81105c83ec9d17e06c]:
: Prelude Data.Char> 'J'

